### Transformacija podataka

In [1]:
import pandas as pd

Uƒçitavanje dataseta

In [2]:
df = pd.read_csv('datasets/NFL Play by Play 2009-2017.csv')

C:\Users\imoce\AppData\Local\Temp\ipykernel_22036\4244261057.py:1: DtypeWarning: Columns (25,51) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_csv('datasets/NFL Play by Play 2009-2017.csv')

In [3]:
df.shape

(407688, 102)

In [4]:
df.head(10)

,Date,GameID,Drive,qtr,down,time,TimeUnder,TimeSecs,PlayTimeDiff,SideofField,...,yacEPA,Home_WP_pre,Away_WP_pre,Home_WP_post,Away_WP_post,Win_Prob,WPA,airWPA,yacWPA,Season
0,2009-09-10,2009091000,1,1,NaN,15:00,15,3600.0,0.0,TEN,...,NaN,0.485675,0.514325,0.546433,0.453567,0.485675,0.060758,NaN,NaN,2009
1,2009-09-10,2009091000,1,1,1.0,14:53,15,3593.0,7.0,PIT,...,1.146076,0.546433,0.453567,0.551088,0.448912,0.546433,0.004655,-0.032244,0.036899,2009
2,2009-09-10,2009091000,1,1,2.0,14:16,15,3556.0,37.0,PIT,...,NaN,0.551088,0.448912,0.510793,0.489207,0.551088,-0.040295,NaN,NaN,2009
3,2009-09-10,2009091000,1,1,3.0,13:35,14,3515.0,41.0,PIT,...,-5.031425,0.510793,0.489207,0.461217,0.538783,0.510793,-0.049576,0.106663,-0.156239,2009
4,2009-09-10,2009091000,1,1,4.0,13:27,14,3507.0,8.0,PIT,...,NaN,0.461217,0.538783,0.558929,0.441071,0.461217,0.097712,NaN,NaN,2009
5,2009-09-10,2009091000,2,1,1.0,13:16,14,3496.0,11.0,TEN,...,NaN,0.558929,0.441071,0.578453,0.421547,0.441071,-0.019524,NaN,NaN,2009
6,2009-09-10,2009091000,2,1,2.0,12:40,13,3460.0,36.0,TEN,...,0.163935,0.578453,0.421547,0.582881,0.417119,0.421547,-0.004427,-0.010456,0.006029,2009
7,2009-09-10,2009091000,2,1,3.0,12:11,13,3431.0,29.0,TEN,...,NaN,0.582881,0.417119,0.617544,0.382456,0.417119,-0.034663,NaN,NaN,2009
8,2009-09-10,2009091000,2,1,4.0,11:34,12,3394.0,37.0,TEN,...,NaN,0.617544,0.382456,0.591489,0.408511,0.382456,0.026054,NaN,NaN,2009
9,2009-09-10,2009091000,3,1,1.0,11:24,12,3384.0,10.0,TEN,...,0.541602,0.591489,0.408511,0.585405,0.414595,0.591489,-0.006084,-0.024526,0.018442,2009

In [9]:
df.columns[0:15]

Index(['Date', 'GameID', 'Drive', 'qtr', 'down', 'time', 'TimeUnder',
       'TimeSecs', 'PlayTimeDiff', 'SideofField', 'yrdln', 'yrdline100',
       'ydstogo', 'ydsnet', 'GoalToGo'],
      dtype='object')

Nedostajuƒái podaci - missing data

In [10]:
broj_nan = df.isnull().sum()

broj_nan

Date             0
GameID           0
Drive            0
qtr              0
down         61154
             ...
Win_Prob     25009
WPA           5541
airWPA      248501
yacWPA      248762
Season           0
Length: 102, dtype: int64

In [ ]:
df.shape

Procenat nedostajuƒáih podataka

In [ ]:
ukupno_celija = df.shape[0]*df.shape[1]
ukupno_celija

In [ ]:
ukupno_nedostajucih = broj_nan.sum()
ukupno_nedostajucih

In [ ]:
procenat_nedostajucih = (ukupno_nedostajucih/ukupno_celija)*100
procenat_nedostajucih

In [ ]:
broj_nan[0:10]

Drop missing values

In [11]:
df.dropna()

Empty DataFrame
Columns: [Date, GameID, Drive, qtr, down, time, TimeUnder, TimeSecs, PlayTimeDiff, SideofField, yrdln, yrdline100, ydstogo, ydsnet, GoalToGo, FirstDown, posteam, DefensiveTeam, desc, PlayAttempted, Yards.Gained, sp, Touchdown, ExPointResult, TwoPointConv, DefTwoPoint, Safety, Onsidekick, PuntResult, PlayType, Passer, Passer_ID, PassAttempt, PassOutcome, PassLength, AirYards, YardsAfterCatch, QBHit, PassLocation, InterceptionThrown, Interceptor, Rusher, Rusher_ID, RushAttempt, RunLocation, RunGap, Receiver, Receiver_ID, Reception, ReturnResult, Returner, BlockingPlayer, Tackler1, Tackler2, FieldGoalResult, FieldGoalDistance, Fumble, RecFumbTeam, RecFumbPlayer, Sack, Challenge.Replay, ChalReplayResult, Accepted.Penalty, PenalizedTeam, PenaltyType, PenalizedPlayer, Penalty.Yards, PosTeamScore, DefTeamScore, ScoreDiff, AbsScoreDiff, HomeTeam, AwayTeam, Timeout_Indicator, Timeout_Team, posteam_timeouts_pre, HomeTimeouts_Remaining_Pre, AwayTimeouts_Remaining_Pre, HomeTimeouts_Remaining_Post, AwayTimeouts_Remaining_Post, No_Score_Prob, Opp_Field_Goal_Prob, Opp_Safety_Prob, Opp_Touchdown_Prob, Field_Goal_Prob, Safety_Prob, Touchdown_Prob, ExPoint_Prob, TwoPoint_Prob, ExpPts, EPA, airEPA, yacEPA, Home_WP_pre, Away_WP_pre, Home_WP_post, Away_WP_post, Win_Prob, WPA, airWPA, ...]
Index: []

[0 rows x 102 columns]

In [12]:
df_droped = df.dropna(axis=1)

In [13]:
print(f"Broj kolona u orginalnom datasetu: {df.shape[1]}")
print(f"Broj kolone nakon dropanja: {df_droped.shape[1]}")

Broj kolona u orginalnom datasetu: 102
Broj kolone nakon dropanja: 37

Popunjavanje nedostajuƒáih vrijednosti

In [37]:
subset_data = df.loc[:,'EPA':'Season']
subset_data

,EPA,airEPA,yacEPA,Home_WP_pre,Away_WP_pre,Home_WP_post,Away_WP_post,Win_Prob,WPA,airWPA,yacWPA,Season
0,2.014474,NaN,NaN,0.485675,0.514325,0.546433,0.453567,0.485675,0.060758,NaN,NaN,2009
1,0.077907,-1.068169,1.146076,0.546433,0.453567,0.551088,0.448912,0.546433,0.004655,-0.032244,0.036899,2009
2,-1.402760,NaN,NaN,0.551088,0.448912,0.510793,0.489207,0.551088,-0.040295,NaN,NaN,2009
3,-1.712583,3.318841,-5.031425,0.510793,0.489207,0.461217,0.538783,0.510793,-0.049576,0.106663,-0.156239,2009
4,2.097796,NaN,NaN,0.461217,0.538783,0.558929,0.441071,0.461217,0.097712,NaN,NaN,2009
...,...,...,...,...,...,...,...,...,...,...,...,...
407683,0.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0.000000,NaN,NaN,2017
407684,-0.340818,0.056697,-0.397515,0.080409,0.919591,0.050478,0.949522,0.080409,-0.029931,-0.021795,-0.008136,2017
407685,0.139913,-2.317201,2.457114,0.050478,0.949522,0.030881,0.969119,0.050478,-0.019597,-0.030603,0.011006,2017
407686,0.000000,NaN,NaN,0.030881,0.969119,0.000000,1.000000,0.969119,0.030881,NaN,NaN,2017
407687,0.000000,NaN,NaN,0.000000,1.000000,0.000000,1.000000,0.999159,0.000000,NaN,NaN,2017

In [49]:
subset_data.ffill(inplace=True)
#subset_data.fillna(0)

subset_data.isna().sum()

EPA             0
airEPA          0
yacEPA          0
Home_WP_pre     0
Away_WP_pre     0
Home_WP_post    0
Away_WP_post    0
Win_Prob        0
WPA             0
airWPA          0
yacWPA          0
Season          0
dtype: int64

Pronalazak duplikata

In [57]:
data = pd.read_csv('datasets\employees.csv')

<>:1: SyntaxWarning: invalid escape sequence '\e'
<>:1: SyntaxWarning: invalid escape sequence '\e'
C:\Users\imoce\AppData\Local\Temp\ipykernel_22036\2883623222.py:1: SyntaxWarning: invalid escape sequence '\e'
  data = pd.read_csv('datasets\employees.csv')

In [58]:
data.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services

In [ ]:
data.shape

In [59]:
data.isnull().sum()
data

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services
...,...,...,...,...,...,...,...,...
995,Henry,NaN,11/23/2014,6:09 AM,132483,16.655,False,Distribution
996,Phillip,Male,1/31/1984,6:30 AM,42392,19.675,False,Finance
997,Russell,Male,5/20/2013,12:39 PM,96914,1.421,False,Product
998,Larry,Male,4/20/2013,4:45 PM,60500,11.985,False,Business Development
999,Albert,Male,5/15/2012,6:24 PM,129949,10.169,True,Sales

In [62]:
data.dropna(inplace=True)

In [63]:
data

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services
5,Dennis,Male,4/18/1987,1:35 AM,115163,10.125,False,Legal
...,...,...,...,...,...,...,...,...
994,George,Male,6/21/2013,5:47 PM,98874,4.479,True,Marketing
996,Phillip,Male,1/31/1984,6:30 AM,42392,19.675,False,Finance
997,Russell,Male,5/20/2013,12:39 PM,96914,1.421,False,Product
998,Larry,Male,4/20/2013,4:45 PM,60500,11.985,False,Business Development
999,Albert,Male,5/15/2012,6:24 PM,129949,10.169,True,Sales

In [ ]:
data.duplicated().sum()

In [ ]:
data.duplicated(subset='First Name', keep = 'first').sum()

In [ ]:
data.drop_duplicates(subset='First Name', keep = 'first')

In [65]:
data['First Name'].unique()

array(['Douglas', 'Maria', 'Jerry', 'Larry', 'Dennis', 'Ruby', 'Angela',
       'Frances', 'Julie', 'Brandon', 'Gary', 'Kimberly', 'Lillian',
       'Jeremy', 'Shawn', 'Diana', 'Donna', 'Matthew', 'John', 'Craig',
       'Terry', 'Benjamin', 'Christina', 'Jean', 'Theresa', 'Rachel',
       'Linda', 'Stephanie', 'Michael', 'Beverly', 'Marilyn', 'Cynthia',
       'Roger', 'Bruce', 'Kathy', 'Clarence', 'Nancy', 'Todd', 'Sara',
       'Karen', 'Carl', 'Henry', 'Irene', 'Denise', 'Steve', 'Jose',
       'Johnny', 'Bobby', 'Thomas', 'Bonnie', 'Margaret', 'Charles',
       'Robin', 'Christopher', 'Steven', 'Doris', 'Annie', 'Janice',
       'Harry', 'Heather', 'Tina', 'Harold', 'Melissa', 'Aaron', 'Jack',
       'Phyllis', 'Paul', 'Shirley', 'Willie', 'Ashley', 'Pamela',
       'Andrea', 'Peter', 'Helen', 'Patricia', 'Michelle', 'William',
       'Kenneth', 'Antonio', 'Rebecca', 'Carlos', 'Lois', 'Carolyn',
       'Gloria', 'Adam', 'Elizabeth', 'Jennifer', 'Philip', 'Sean',
       'Ruth', 'Marie', 'Howard', 'Norma', 'Arthur', 'Mary', 'Patrick',
       'Victor', 'Wayne', 'Jane', 'Jessica', 'Mark', 'Randy', 'Sandra',
       'Carol', 'Ronald', 'Katherine', 'Jonathan', 'Emily', 'Lisa',
       'Evelyn', 'Billy', 'Gregory', 'Jason', 'Daniel', 'Sarah', 'Diane',
       'Kathryn', 'Laura', 'Cheryl', 'Kevin', 'Walter', 'Robert', 'Jimmy',
       'Justin', 'Betty', 'Ralph', 'Edward', 'Debra', 'Anne', 'Roy',
       'Fred', 'Nicholas', 'Christine', 'Brenda', 'Judy', 'Tammy',
       'Jesse', 'Virginia', 'Alan', 'James', 'Gerald', 'Jacqueline',
       'Russell', 'Jeffrey', 'Samuel', 'Earl', 'Richard', 'Scott', 'Lori',
       'Susan', 'Joshua', 'Juan', 'Albert', 'Stephen', 'Rose', 'Sharon',
       'Joe', 'Ernest', 'Julia', 'Dorothy', 'Deborah', 'Alice', 'Frank',
       'Wanda', 'Louise', 'Lawrence', 'Amy', 'Ryan', 'Judith', 'Barbara',
       'Eugene', 'Donald', 'Ann', 'Raymond', 'Catherine', 'Kathleen',
       'Amanda', 'Anna', 'Joseph', 'Andrew', 'Kelly', 'Louis', 'Teresa',
       'Mildred', 'Eric', 'Timothy', 'Anthony', 'Martha', 'Brian', 'Joan',
       'Nicole', 'Martin', 'Janet', 'George', 'Keith', 'Joyce', 'Phillip',
       'David', 'Paula'], dtype=object)

In [66]:
data.columns

Index(['First Name', 'Gender', 'Start Date', 'Last Login Time', 'Salary',
       'Bonus %', 'Senior Management', 'Team'],
      dtype='object')

Mapiranje

‚Ä¢	replace(): zamjenjuje vrijednosti \
‚Ä¢	map(): stvara novu kolonu \
‚Ä¢	rename(): zamjenjuje vrijednosti indeksa

In [ ]:
data.head(10)

.replace()

In [77]:
data['Team'] = data['Team'].replace('Finance', 'Finansije' )
data['Gender'] = data['Gender'].replace({'Male': 'Mu≈°ko',
                        'Female': '≈Ωensko'})
data

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Mu≈°ko,8/6/1993,12:42 PM,97308,6.945,True,Marketing
2,Maria,≈Ωensko,4/23/1993,11:17 AM,130590,11.858,False,Finansije
3,Jerry,Mu≈°ko,3/4/2005,1:00 PM,138705,9.340,True,Finansije
4,Larry,Mu≈°ko,1/24/1998,4:47 PM,101004,1.389,True,Client Services
5,Dennis,Mu≈°ko,4/18/1987,1:35 AM,115163,10.125,False,Legal
...,...,...,...,...,...,...,...,...
994,George,Mu≈°ko,6/21/2013,5:47 PM,98874,4.479,True,Marketing
996,Phillip,Mu≈°ko,1/31/1984,6:30 AM,42392,19.675,False,Finansije
997,Russell,Mu≈°ko,5/20/2013,12:39 PM,96914,1.421,False,Product
998,Larry,Mu≈°ko,4/20/2013,4:45 PM,60500,11.985,False,Business Development
999,Albert,Mu≈°ko,5/15/2012,6:24 PM,129949,10.169,True,Sales

In [78]:
data.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Mu≈°ko,8/6/1993,12:42 PM,97308,6.945,True,Marketing
2,Maria,≈Ωensko,4/23/1993,11:17 AM,130590,11.858,False,Finansije
3,Jerry,Mu≈°ko,3/4/2005,1:00 PM,138705,9.340,True,Finansije
4,Larry,Mu≈°ko,1/24/1998,4:47 PM,101004,1.389,True,Client Services
5,Dennis,Mu≈°ko,4/18/1987,1:35 AM,115163,10.125,False,Legal

In [87]:
data['Gender'] = data['Gender'].replace(['Mu≈°ko','≈Ωensko'], ['M','F'])

data.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,M,8/6/1993,12:42 PM,97308,6.945,Taƒçno,Marketing
2,Maria,F,4/23/1993,11:17 AM,130590,11.858,Netaƒçno,Finansije
3,Jerry,M,3/4/2005,1:00 PM,138705,9.340,Taƒçno,Finansije
4,Larry,M,1/24/1998,4:47 PM,101004,1.389,Taƒçno,Client Services
5,Dennis,M,4/18/1987,1:35 AM,115163,10.125,Netaƒçno,Legal

In [ ]:
type(data['Senior Management'][0])

In [88]:
skracenice = {
    'Taƒçno' : 'Da',
    'Netaƒçno' : 'Ne'
}

In [89]:
data.replace(skracenice, inplace=True)

data.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,M,8/6/1993,12:42 PM,97308,6.945,Da,Marketing
2,Maria,F,4/23/1993,11:17 AM,130590,11.858,Ne,Finansije
3,Jerry,M,3/4/2005,1:00 PM,138705,9.340,Da,Finansije
4,Larry,M,1/24/1998,4:47 PM,101004,1.389,Da,Client Services
5,Dennis,M,4/18/1987,1:35 AM,115163,10.125,Ne,Legal

In [96]:
data['First Name'] = data['First Name'].str.title()
data

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,M,8/6/1993,12:42 PM,97308,6.945,Da,Marketing
2,Maria,F,4/23/1993,11:17 AM,130590,11.858,Ne,Finansije
3,Jerry,M,3/4/2005,1:00 PM,138705,9.340,Da,Finansije
4,Larry,M,1/24/1998,4:47 PM,101004,1.389,Da,Client Services
5,Dennis,M,4/18/1987,1:35 AM,115163,10.125,Ne,Legal
...,...,...,...,...,...,...,...,...
994,George,M,6/21/2013,5:47 PM,98874,4.479,Da,Marketing
996,Phillip,M,1/31/1984,6:30 AM,42392,19.675,Ne,Finansije
997,Russell,M,5/20/2013,12:39 PM,96914,1.421,Ne,Product
998,Larry,M,4/20/2013,4:45 PM,60500,11.985,Ne,Business Development
999,Albert,M,5/15/2012,6:24 PM,129949,10.169,Da,Sales

In [90]:
type(data['Senior Management'][0])

str

.map()/apply()

In [ ]:
def povecanje_bonusa(x):
    return x+1

data['Bonus %'] = data['Bonus %'].map(povecanje_bonusa)
data

In [ ]:
def bonus(df):
    return df['Salary']*df['Bonus %']/100

data['Bonus u $'] = data.apply(bonus, axis=1)
data

.rename()

In [ ]:
data.rename(columns={'First Name':'Ime', 'Bonus %':'Bonus u %'}, inplace=True)

In [ ]:
data

In [ ]:
data.describe()

### Rad sa tekstualnim podacima

In [111]:
data = pd.read_csv('datasets\chicago.csv')

<>:1: SyntaxWarning: invalid escape sequence '\c'
<>:1: SyntaxWarning: invalid escape sequence '\c'
C:\Users\imoce\AppData\Local\Temp\ipykernel_22036\2935289460.py:1: SyntaxWarning: invalid escape sequence '\c'
  data = pd.read_csv('datasets\chicago.csv')

In [ ]:
data.head()

In [ ]:
data.info()

In [ ]:
data.nunique()

In [100]:
data["Department"] = data["Department"].astype('category')

In [ ]:
data.info()

In [ ]:
data.tail()

.lower(), .upper(), .title() i .len()

In [ ]:
"PYTHON".lower()

In [ ]:
"python".upper()

In [ ]:
"ucimo python".title()

In [ ]:
len("ucimo python")

In [ ]:
data["Name"].str.lower()

In [ ]:
data["Name"] = data["Name"].str.title()
data["Position Title"] = data["Position Title"].str.title()

data.head()

In [101]:
data['Department'].str.len()

0        11.0
1         6.0
2         6.0
3        16.0
4        11.0
         ...
32058     6.0
32059     6.0
32060     6.0
32061     4.0
32062     NaN
Name: Department, Length: 32063, dtype: float64

In [132]:
indices_nan = data.index[data.isna().any(axis=1)]

indices_nan

Index([31449, 32063], dtype='int64')

str.replace()

In [ ]:
"ucimo python".replace("c","ƒç")

In [ ]:
data.tail()

In [ ]:
data.dropna(how='all', inplace=True)

data.tail()

In [ ]:
data["Department"]

In [ ]:
data["Department"].str.replace("MGMNT", "MANAGMENT")

In [ ]:
data['Employee Annual Salary'] = data['Employee Annual Salary'].str.replace('$','').astype(float)

In [ ]:
data['Employee Annual Salary'].describe()

In [ ]:
data['Employee Annual Salary'].nlargest()

In [ ]:
data.loc[8184]

In [ ]:
data['Employee Annual Salary'].nsmallest()

In [ ]:
data.loc[15102]

Filtriranje pomoƒáu string metoda

In [ ]:
filter = data['Position Title'].str.lower().str.contains('water')

data[filter]

In [ ]:
data[data['Position Title'].str.lower().str.startswith('water')]

In [ ]:
data[data['Position Title'].str.lower().str.endswith('inspector')]

.str.split()

In [ ]:
"Ucimo analizu podataka pomoƒáu Pandas".split()

In [ ]:
data["Name"].str.split(",")

In [ ]:
data["Name"].str.split(",").str.get(0).str.title().value_counts()

In [ ]:
data['Position Title'].str.split().str.get(0).value_counts()

In [ ]:
# provjera najucestalijih imena
data["Name"].str.split(",").str.get(1).str.split().str.get(0).value_counts()